backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("full_name", "email", "password_digest", "receive_updates", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"